class AboutUsStrings {
  static const String educationTitle = "Специалности и условия за обучение";

  static const String educationDescription = "Обучението в Геолого-географския факултет обхваща всички образователни степени – бакалавър, магистър и доктор. Учебната година е разделена на два семестъра по 15 седмици, изпитна сесия в края на всеки семестър и започва на 1 октомври. Учебният процес се състои от лекции и семинарни занятия, а също така включва и индивидуални форми на обучение – доклади, лабораторни занятия, практики и др. \n\nУчебните практики до определени геоложки, географски и туристически обекти се провеждат след края на летния семестър.\n\nПонастоящем във факултета се обучават около 900 български и чуждестранни студенти по седем специалности – Геология, Геология и проучване на природни ресурси, География, Туризъм, Регионално развитие и политика, Геопространствени системи и технологии и География и английски език. Обучението се осъществява в редовна и задочна форма, по държавна поръчка или срещу заплащане.\n\nГеолого-географският факултет извършва и допълнително следдипломно обучение и квалификация, както по основните специалности, така и в по-тесни научни направления.";

  static const String teacherTitle = "Преподавателски състав";

  static const String teacherDescription = "Във факултета преподават над 80 високо квалифицирани професори, доценти и асистенти. В тяхната изследователска и преподавателска работа им помагат над 30 специалисти с висше образование.";
}