import 'package:flutter/material.dart';

class HistoryScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text("История"),
      ),
      body: SingleChildScrollView(
          child: Padding(
        padding: const EdgeInsets.all(10.0),
        child: Column(
          children: const [
            Text(
              "Геолого-географският факултет на Софийския Университет съществува от 1963 година. Съществуващият дотогава Биолого-геолого-географски факултет е разделен на ГГФ и Биологически факултет. Образованието по геология в Университета обаче започва още през 1891 г. с откриването на специалността Геология. През 1898 г. в Историко-филологическия факултет се учредява катедра по география и етнография с което се полага началото на обучението по специалност География. Специалност Туризъм се разкрива през 1967, История и география (съвместно с Исторически факултет) през 1999 г., География и Биология (съвместно с Биологически факултет) през 1999 г., Регионално развитие и политика през 2005 г., География и английски език през 2018 г., Геопространствени системи и технологии през 2019 г., а през 2021 г. – Геология и проучване на природни ресурси. Към момента във факултета се обучават студенти в четири основни професионални направления – “Науки за Земята”, “Администрация и управление”, “Туризъм” и “Педагогика на обучението по…”.",
              style: TextStyle(
                fontSize: 17,
              ),
            ),
            SizedBox(
              height: 10,
            ),
            Text(
              "Основател и ръководител на първата катедра по География повече от 35 години е академик проф. Анастас Иширков (1868-1937), а научните ѝ основи са свързани с класическата антропогеография. През 1892 г. Иширков е изпратен на специализация по славянска филология в гр. Лайпциг, където посещава лекциите по география при проф. Фр. Ратцел. През август 1895 г. той завършва докторския си изпит с главен предмет география при Ратцел. След завръщането си е назначен за учител по география в София, а следващата година е изпратен от МНП в Берлинския университет, където продължава специализацията си при известния географ изследовател Ф. Рихтхофен. През 1915 – 1916 г. е избран за 17-и ректор на Софийския университет. Основател и председател на Българското геогрфаско дружество от 9 ноември 1918 г. до 1934 г. Като вземем под внимание преподавателската му дейност и научно творчество се установява, че Иширков полага основите на почти всички гегорафски дисциплини и направления в съответствие на тогавашното ниво на географската наука. Под влияние на европейските тенденции и главно на немската географска школа в географията се осъществява диференциация. Оформят се двете основни направления – физическата география и икономическата география (Анастас Бешков, 1896-1964). Антропогеографията е заменена с икономическа география, която макар и по-късно също претърпява структурни промени. В изследванията наред с класическите методи се използват и математически, географските изследвания се използват за решаването на социални, стопански и управленски задачи.",
              style: TextStyle(fontSize: 17),
            ),
            SizedBox(
              height: 10,
            ),
            Text(
              "Днес в седемте бакалавърски специалности на нашия факултет се обучават приблизително 1000 български и чуждестранни студенти, в редовна и задочна форма. Учебните занятия се провеждат от екип от над 80 висококвалифицирани професори, доценти и асистенти, които в учебноизследователската работа се подпомагат от над 30 специалисти.",
              style: TextStyle(fontSize: 17),
            ),
            SizedBox(
              height: 10,
            ),
            Text(
              "В учебния процес във факултета се акцентира както върху лекционните и семинарните занятия, така и върху индивидуалните форми на обучение – доклади, задачи, лабораторни и теренни практики. Учебните практики – стационарни или екскурзии до определени геоложки, географски или туристически обекти, се провеждат след края на летния семестър.",
              style: TextStyle(fontSize: 17),
            ),
          ],
        ),
      )),
    );
  }
}
